Tekla.Structures.Drawing.ScalingOptions.ScaleXY
Scales the DWG or DXF object in the X and Y directions.

Tekla.Structures.Drawing.ScalingOptions.ScaleBestFit
The DWG or DXF object is scaled inside the frame,
still maintaining its original aspect ratio.